tutorials/rectangle2D/system/fvSchemes
/*
--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/constant/inputParameters"

ddtSchemes
{
    default             CrankNicolson 0.9;
    ddt(phi)	        CrankNicolson 0.9;
}

gradSchemes
{
    default             Gauss linear;
    grad(p)             Gauss linear;
}

divSchemes
{
    default             none;
    div(phi,U)          Gauss linear; // advective flux NS eqns
    div(phiPlt,Plt)     Gauss limitedVanLeer 0.0 $Pmax; // advective flux Pm equations
    div(phi,chems)      Gauss vanLeer; // advective flux ADP and other chems
}

laplacianSchemes
{
    default             Gauss linear orthogonal;
}

interpolationSchemes
{
    default	                linear;
    interpolate(Theta_Tfa)  downwind phi;
    interpolate(Theta_Tfd)  localMax;
}

snGradSchemes
{
    default             orthogonal;
}


// ************************************************************************* //
